English/NewWords/Amercia-TheStoryOfUs-WW2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Amercia-The Story Of Us-World War Ⅱ</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Amercia-The Story Of Us-World War Ⅱ"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-06 22:58:09 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#english">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">Amercia-The Story Of Us-World War Ⅱ</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>

<center><iframe width="560" height="315" src="http://www.youtube.com/embed/CuU21Z4PEfM?rel=0" frameborder="0" allowfullscreen></iframe></center>

<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 trailblazer</a></li>
<li><a href="#sec-2">2 ration</a></li>
<li><a href="#sec-3">3 treachery</a></li>
<li><a href="#sec-4">4 cutting-edge</a></li>
<li><a href="#sec-5">5 stunning</a></li>
<li><a href="#tactical">6 tactical</a></li>
<li><a href="#sec-7">7 sitting ducks</a></li>
<li><a href="#sec-8">8 flaunt</a></li>
<li><a href="#sec-9">9 gadget</a></li>
<li><a href="#sec-10">10 out of action</a></li>
<li><a href="#sec-11">11 squadron</a></li>
<li><a href="#sec-12">12 infamy</a></li>
<li><a href="#sec-13">13 unleash</a></li>
<li><a href="#sec-14">14 wrath</a></li>
<li><a href="#sec-15">15 underutilize</a></li>
<li><a href="#sec-16">16 spree</a></li>
<li><a href="#sec-17">17 arsenal</a></li>
<li><a href="#sec-18">18 bumper</a></li>
<li><a href="#sec-19">19 jerricans</a></li>
<li><a href="#sec-20">20 glider</a></li>
<li><a href="#sec-21">21 SUV</a></li>
<li><a href="#sec-22">22 munition</a></li>
<li><a href="#sec-23">23 magnesium</a></li>
<li><a href="#sec-24">24 detonator</a></li>
<li><a href="#sec-25">25 cramped</a></li>
<li><a href="#sec-26">26 casualty</a></li>
<li><a href="#sec-27">27 rest on</a></li>
<li><a href="#sec-28">28 elation</a></li>
<li><a href="#sec-29">29 segregate</a></li>
<li><a href="#sec-30">30 overlord</a></li>
<li><a href="#sec-31">31 draw on</a></li>
<li><a href="#sec-32">32 plasma</a></li>
<li><a href="#sec-33">33 ritual</a></li>
<li><a href="#sec-34">34 rattle</a></li>
<li><a href="#sec-35">35 stealth</a></li>
<li><a href="#sec-36">36 gut</a></li>
<li><a href="#sec-37">37 staggering</a></li>
<li><a href="#sec-38">38 fission</a></li>
<li><a href="#sec-39">39 intact</a></li>
<li><a href="#sec-40">40 vibrant</a></li>
<li><a href="#sec-41">41 colossus</a></li>
<li><a href="#sec-42">42 dynamite</a></li>
<li><a href="#sec-43">43 wreak</a></li>
<li><a href="#sec-44">44 escalate</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> trailblazer</h2>
<div class="outline-text-2" id="text-1">

<p>  trail 路<br/>
  blaze 烧<br/>
  blaze a trail 开辟道路<br/>
  trailblazer 开拓者，先驱<br/>
</p>


<pre class="example">We're pioneers...and trailblazers.
</pre>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> ration</h2>
<div class="outline-text-2" id="text-2">

<p>  为士兵，海员或平民提供的固定数量的供给（尤其是在战时或物资紧缺的时候）<br/>
  来自rate,按比例分配<br/>
  SYN：portion<br/>
</p>


<pre class="example">Now every weapon, ration, medical supply is mass-produced on a scale never seen in human history.
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> treachery</h2>
<div class="outline-text-2" id="text-3">

<p>  背叛<br/>
  SYN: betrayal, disloyalty<br/>
  adj: treacherous<br/>
  adv: treacherously<br/>
</p>


<pre class="example">But the road to greatness begins with treachery.
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> cutting-edge</h2>
<div class="outline-text-2" id="text-4">

<p>  前沿<br/>
  SYN:forefront<br/>
</p>


<pre class="example">A pack of cutting-edge killing machines are on a mission.
</pre>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> stunning</h2>
<div class="outline-text-2" id="text-5">

<p>  令人震惊的<br/>
  SYN: astonishing, surprising<br/>
</p>


<pre class="example">When Pearl Harbor was attacked, it was one of the most stunning moments in Amercian history. 
</pre>

</div>

</div>

<div id="outline-container-tactical" class="outline-2">
<h2 id="tactical"><a name="sec-6" id="sec-6"></a><span class="section-number-2">6</span> tactical</h2>
<div class="outline-text-2" id="text-tactical">

<p>  战术上的，战略上的<br/>
  n: tactic<br/>
</p>


<pre class="example">If I could reach out and touch you from greater distance, I had a tactical strategic advantage.
</pre>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> sitting ducks</h2>
<div class="outline-text-2" id="text-7">

<p>  无助的/活靶子/牺牲品<br/>
</p>


<pre class="example">We had almost our whole fleet in one little harbor, one little area. We're sitting ducks.
</pre>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> flaunt</h2>
<div class="outline-text-2" id="text-8">

<p>  炫耀<br/>
  SYN: show off, vaunt<br/>
</p>


<pre class="example">The surprise attack flaunts the specialty of Amercian rifle man in the War of Independence. The
tactic that made Amercia free is now being used against it.
</pre>

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> gadget</h2>
<div class="outline-text-2" id="text-9">

<p>  小玩意，小器件<br/>
  SYN：widget, whatsis<br/>
</p>


<pre class="example">but radar is still considered a gadget by the military.
</pre>

</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> out of action</h2>
<div class="outline-text-2" id="text-10">

<p>  坏了/不能用了<br/>
  put out of action 失去战斗力<br/>
</p>


<pre class="example">All eight battleships are put out of action.
</pre>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> squadron</h2>
<div class="outline-text-2" id="text-11">

<p>  squad 小队/班[军]<br/>
  squadron 空军中队/小舰队 <br/>
</p>


<pre class="example">The low flying Japanese squadron vanishes from the screen.
</pre>

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> infamy</h2>
<div class="outline-text-2" id="text-12">

<p>  extremely bad reputation. 声名狼藉<br/>
  infamous 无耻的/声名狼藉的<br/>
</p>


<pre class="example">A day that will live in infamy.
</pre>

</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> unleash</h2>
<div class="outline-text-2" id="text-13">

<p>  leash 皮带/束缚<br/>
  unleash 释放/发泄<br/>
</p></div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> wrath</h2>
<div class="outline-text-2" id="text-14">

<p>  strong, fierce anger<br/>
</p>


<pre class="example">It unleash the wrath of Amercia and I think it gave us an energy that carried us through the rest of the war. 
</pre>

</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> underutilize</h2>
<div class="outline-text-2" id="text-15">

<p>  未充分利用<br/>
  utilize-&gt;utilization<br/>
</p></div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> spree</h2>
<div class="outline-text-2" id="text-16">

<p>  狂欢<br/>
  go on a spree 放纵/不受约束<br/>
</p>


<pre class="example">We are ready to go on a building spree.
</pre>

</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> arsenal</h2>
<div class="outline-text-2" id="text-17">

<p>  兵工厂/军火库<br/>
</p>


<pre class="example">Amercia tranforms into an arsenal democracy.
</pre>

</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> bumper</h2>
<div class="outline-text-2" id="text-18">

<p>  bump 冲撞<br/>
  bumper 保险杠/缓冲器<br/>
</p>


<pre class="example">Even the front bumper is a seat.
</pre>

</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> jerricans</h2>
<div class="outline-text-2" id="text-19">

<p>  油桶<br/>
</p></div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> glider</h2>
<div class="outline-text-2" id="text-20">

<p>  glide 滑翔<br/>
  glider 滑翔机<br/>
</p></div>

</div>

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> SUV</h2>
<div class="outline-text-2" id="text-21">

<p>  Sport Utility Vehicles 越野车 <br/>
</p></div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> munition</h2>
<div class="outline-text-2" id="text-22">

<p>  军需品<br/>
</p>


<pre class="example">Now she works in a munitions factory.
</pre>

</div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> magnesium</h2>
<div class="outline-text-2" id="text-23">

<p>  镁<br/>
</p></div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> detonator</h2>
<div class="outline-text-2" id="text-24">

<p>  雷管<br/>
</p></div>

</div>

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> cramped</h2>
<div class="outline-text-2" id="text-25">

<p>  cramp 抽筋<br/>
  cramped 拥挤的<br/>
</p></div>

</div>

<div id="outline-container-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> casualty</h2>
<div class="outline-text-2" id="text-26">

<p>  死亡人数<br/>
</p></div>

</div>

<div id="outline-container-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> rest on</h2>
<div class="outline-text-2" id="text-27">

<p>  depend on<br/>
</p></div>

</div>

<div id="outline-container-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> elation</h2>
<div class="outline-text-2" id="text-28">

<p>  elate 使高兴<br/>
  elation 兴高采烈<br/>
</p>


<pre class="example">A feeling of elation took hold of us as we winged back across the channel. 
</pre>

</div>

</div>

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> segregate</h2>
<div class="outline-text-2" id="text-29">

<p>  隔离/分离<br/>
  segregation/segregated<br/>
</p></div>

</div>

<div id="outline-container-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> overlord</h2>
<div class="outline-text-2" id="text-30">

<p>  霸王<br/>
  Operation Overlord<br/>
</p></div>

</div>

<div id="outline-container-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> draw on</h2>
<div class="outline-text-2" id="text-31">

<p>  make use of<br/>
</p></div>

</div>

<div id="outline-container-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> plasma</h2>
<div class="outline-text-2" id="text-32">

<p>  血浆<br/>
</p></div>

</div>

<div id="outline-container-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> ritual</h2>
<div class="outline-text-2" id="text-33">

<p>  仪式/礼仪<br/>
</p></div>

</div>

<div id="outline-container-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> rattle</h2>
<div class="outline-text-2" id="text-34">

<p>  发出响声<br/>
</p></div>

</div>

<div id="outline-container-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> stealth</h2>
<div class="outline-text-2" id="text-35">

<p>  secret<br/>
</p></div>

</div>

<div id="outline-container-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> gut</h2>
<div class="outline-text-2" id="text-36">

<p>  内脏<br/>
</p>


<pre class="example">There were men with guts hanging out of their wounds and body parts lying along out path. 
</pre>

</div>

</div>

<div id="outline-container-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> staggering</h2>
<div class="outline-text-2" id="text-37">

<p>  surprising<br/>
</p></div>

</div>

<div id="outline-container-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> fission</h2>
<div class="outline-text-2" id="text-38">

<p>  分裂/裂变<br/>
</p></div>

</div>

<div id="outline-container-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> intact</h2>
<div class="outline-text-2" id="text-39">

<p>  完好无损的<br/>
  remain uninjured, sound or whole<br/>
</p></div>

</div>

<div id="outline-container-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> vibrant</h2>
<div class="outline-text-2" id="text-40">

<p>  保持生机的<br/>
</p>


<pre class="example">Amercia's distance from battle leaves its infrastructure intact and its economy vibrant. 
</pre>

</div>

</div>

<div id="outline-container-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> colossus</h2>
<div class="outline-text-2" id="text-41">

<p>  巨人<br/>
  colossal 巨大的<br/>
  SYN: giant gigantic<br/>
</p>


<pre class="example">Amercia could be the colossus that it became.
</pre>

</div>

</div>

<div id="outline-container-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> dynamite</h2>
<div class="outline-text-2" id="text-42">

<p>  炸药<br/>
</p>


<pre class="example">When it went off in the New Mexico dawn, that first atomic bomd, we thought of Afred Nobel and
his hope, his vain hope, that dynamite would put an end to wars.
</pre>

</div>

</div>

<div id="outline-container-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> wreak</h2>
<div class="outline-text-2" id="text-43">

<p>  wreak havoc or destruction 造成损坏<br/>
</p>


<pre class="example">Wreaking that kind of mass destruction, that was something new in history of warfare.
</pre>

</div>

</div>

<div id="outline-container-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> escalate</h2>
<div class="outline-text-2" id="text-44">

<p>  加剧/逐步增强<br/>
</p>


<pre class="example">The use of bombing escalates on all sides in World War Ⅱ.
</pre>

</div>
</div>
</div>

</body>
</html>
